tap "hashicorp/tap"
brew "gcc"
brew "azure-cli"
brew "bitwarden-cli"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "go"
brew "jq"
brew "kubernetes-cli"
brew "make"
brew "markdownlint-cli"
brew "starship"
brew "stow"
brew "tree"
brew "yq"
brew "hashicorp/tap/terraform"
cask "claude-code"
vscode "anthropic.claude-code"
vscode "davidanson.vscode-markdownlint"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grafana.grafana-vscode"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.makefile-tools"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "vstirbu.vscode-mermaid-preview"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
