tap "hashicorp/tap"

brew "azure-cli"
brew "bitwarden-cli"
brew "gcc"
brew "fish"
brew "fzf"
brew "gh"
brew "gitleaks"
brew "go"
brew "hashicorp/tap/terraform"
brew "jq"
brew "keychain"
brew "kubernetes-cli"
brew "make"
brew "markdownlint-cli"
brew "node@24"
brew "starship"
brew "stow"
brew "tree"
brew "yq"
